# taps
tap "homebrew/cask-fonts"
tap "heroku/brew"
tap "homebrew/cask-versions"
tap "cormacrelf/tap"

# packages
brew "fzf"
brew "exa"
brew "git-delta"
brew "awscli"
brew "the_silver_searcher"
brew "node"
brew "wget"
brew "cmake"
brew "tree"
brew "tmux"
brew "go"
brew "luarocks"
brew "pkg-config"
brew "bat"
brew "ripgrep"
brew "magic-wormhole"
brew "git"
brew "youtube-dl"
brew "luajit", args: ["HEAD"]
brew "neovim", args: ["HEAD"]
brew "watchman"
brew "heroku"
brew "gh"
brew "pandoc"
brew "croc"
brew "mosh"
brew "deno"
brew "htop"
brew "cormacrelf/tap/dark-notify"
brew "fd"
brew "yarn"

# casks!
cask "font-inconsolata"
cask "libreoffice"
cask "firefox"
cask "docker"
cask "anki"
cask "signal"
cask "obsidian"
cask "calibre"
cask "mactex"
cask "element"
cask "vlc"
cask "rectangle"
cask "tor-browser"
cask "launchcontrol"
cask "bitwarden"
cask "iterm2-beta"
