# taps
tap "cormacrelf/tap"
tap "heroku/brew"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"

# packages
brew "awscli"
brew "bat"
brew "cmake"
brew "cormacrelf/tap/dark-notify"
brew "croc"
brew "datasette"
brew "deno"
brew "exa"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "go"
brew "heroku"
brew "htop"
brew "jq"
brew "just"
brew "luajit", args: ["HEAD"]
brew "luarocks"
brew "magic-wormhole"
brew "mosh"
brew "neovim", args: ["HEAD"]
brew "node"
brew "pandoc"
brew "pkg-config"
brew "pnpm"
brew "ripgrep"
brew "rust-analyzer"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "volta"
brew "watchman"
brew "wget"
brew "yarn"
brew "youtube-dl"

# casks!
cask "anki"
cask "bitwarden"
cask "blockblock"
cask "cyberduck"
cask "element"
cask "firefox"
cask "font-inconsolata-nerd-font"
cask "hammerspoon"
cask "iterm2-beta"
cask "knockknock"
cask "libreoffice"
cask "lulu"
cask "obsidian"
cask "oversight"
cask "rectangle"
cask "spotify"
cask "thunderbird"
cask "vlc"
